test/multiple_pimpleFoam_snappyPttches/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2312                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    wall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          7504;
        startFace       187079;
    }
    topPatch
    {
        type            patch;
        nFaces          596;
        startFace       194583;
    }
    bottomPatch
    {
        type            patch;
        nFaces          596;
        startFace       195179;
    }
)

// ************************************************************************* //
